## Pandas

https://pandas.pydata.org/docs/index.html

https://pandas.pydata.org/docs/user_guide/10min.html#min

In [1]:
import numpy as np
import pandas as pd

### Object creation

Creating a `Series` by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
type(s)

pandas.core.series.Series

Creating a `DataFrame` by passing a NumPy array, with a datetime index using `date_range()` and labeled columns:

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -1.157775  0.305050  0.338499  1.279784
2013-01-02 -0.591920  1.730402  0.282546 -1.847008
2013-01-03 -0.304947  0.145724 -1.531427  0.804228
2013-01-04 -1.747533  1.220149  0.786982 -0.316845
2013-01-05  1.030304  0.104551 -0.269223  0.690260
2013-01-06 -0.054031 -0.326016 -0.035340 -0.966094

In [6]:
list('ABCD')

['A', 'B', 'C', 'D']

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
np.random.seed(1234)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.471435 -1.190976  1.432707 -0.312652
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118
2013-01-05  0.405453  0.289092  1.321158 -1.546906
2013-01-06 -0.202646 -0.655969  0.193421  0.553439

Creating a `DataFrame` by passing a dictionary of objects that can be converted into a series-like structure:

In [9]:
dic_1 = {
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=range(4), dtype='float'),
    'D': np.array([3]*4, dtype='int'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
}

dic_1

{'A': 1.0,
 'B': Timestamp('2013-01-02 00:00:00'),
 'C': 0    1.0
 1    1.0
 2    1.0
 3    1.0
 dtype: float64,
 'D': array([3, 3, 3, 3]),
 'E': ['test', 'train', 'test', 'train']
 Categories (2, object): ['test', 'train'],
 'F': 'foo'}

In [10]:
df2 = pd.DataFrame(dic_1)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
np.array([3]*4, dtype='float32')

array([3., 3., 3., 3.], dtype=float32)

In [12]:
pd.Series(1., index=list(range(4)))

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [13]:
df2.dtypes

A          float64
B    datetime64[s]
C          float64
D            int32
E         category
F           object
dtype: object

### Viewing data

View the top and bottom rows of the frame respectively:

In [14]:
df.head()

                   A         B         C         D
2013-01-01  0.471435 -1.190976  1.432707 -0.312652
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118
2013-01-05  0.405453  0.289092  1.321158 -1.546906

In [15]:
df.tail()

                   A         B         C         D
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118
2013-01-05  0.405453  0.289092  1.321158 -1.546906
2013-01-06 -0.202646 -0.655969  0.193421  0.553439

Display the `DataFrame.index` or `DataFrame.columns`:

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

The NumPy representation of the underlying data:

In [18]:
df.to_numpy()

array([[ 4.71435164e-01, -1.19097569e+00,  1.43270697e+00,
        -3.12651896e-01],
       [-7.20588733e-01,  8.87162940e-01,  8.59588414e-01,
        -6.36523504e-01],
       [ 1.56963721e-02, -2.24268495e+00,  1.15003572e+00,
         9.91946022e-01],
       [ 9.53324128e-01, -2.02125482e+00, -3.34077366e-01,
         2.11836468e-03],
       [ 4.05453412e-01,  2.89091941e-01,  1.32115819e+00,
        -1.54690555e+00],
       [-2.02646325e-01, -6.55969344e-01,  1.93421376e-01,
         5.53438911e-01]])

In [19]:
np.array(df)

array([[ 4.71435164e-01, -1.19097569e+00,  1.43270697e+00,
        -3.12651896e-01],
       [-7.20588733e-01,  8.87162940e-01,  8.59588414e-01,
        -6.36523504e-01],
       [ 1.56963721e-02, -2.24268495e+00,  1.15003572e+00,
         9.91946022e-01],
       [ 9.53324128e-01, -2.02125482e+00, -3.34077366e-01,
         2.11836468e-03],
       [ 4.05453412e-01,  2.89091941e-01,  1.32115819e+00,
        -1.54690555e+00],
       [-2.02646325e-01, -6.55969344e-01,  1.93421376e-01,
         5.53438911e-01]])

A quick statistic summary of your data:

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.153779 -0.822438  0.770472 -0.158096
std    0.585516  1.247079  0.699548  0.898456
min   -0.720589 -2.242685 -0.334077 -1.546906
25%   -0.148061 -1.813685  0.359963 -0.555556
50%    0.210575 -0.923473  1.004812 -0.155267
75%    0.454940  0.052827  1.278378  0.415609
max    0.953324  0.887163  1.432707  0.991946

Transposing your data:

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.471435   -0.720589    0.015696    0.953324    0.405453   -0.202646
B   -1.190976    0.887163   -2.242685   -2.021255    0.289092   -0.655969
C    1.432707    0.859588    1.150036   -0.334077    1.321158    0.193421
D   -0.312652   -0.636524    0.991946    0.002118   -1.546906    0.553439

Sorting by an axis:

In [22]:
df.sort_index(axis=0)

                   A         B         C         D
2013-01-01  0.471435 -1.190976  1.432707 -0.312652
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118
2013-01-05  0.405453  0.289092  1.321158 -1.546906
2013-01-06 -0.202646 -0.655969  0.193421  0.553439

In [23]:
df

                   A         B         C         D
2013-01-01  0.471435 -1.190976  1.432707 -0.312652
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118
2013-01-05  0.405453  0.289092  1.321158 -1.546906
2013-01-06 -0.202646 -0.655969  0.193421  0.553439

### Selection

#### Getting

Selecting a single column, which yields a `Series`.

In [24]:
df['A']

2013-01-01    0.471435
2013-01-02   -0.720589
2013-01-03    0.015696
2013-01-04    0.953324
2013-01-05    0.405453
2013-01-06   -0.202646
Freq: D, Name: A, dtype: float64

In [25]:
df.A

2013-01-01    0.471435
2013-01-02   -0.720589
2013-01-03    0.015696
2013-01-04    0.953324
2013-01-05    0.405453
2013-01-06   -0.202646
Freq: D, Name: A, dtype: float64

Slicing the rows:

In [26]:
df[:3]

                   A         B         C         D
2013-01-01  0.471435 -1.190976  1.432707 -0.312652
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946

In [27]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118

#### Selection by label

For getting a cross section using a label:

In [28]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df.loc[dates[0]]

A    0.471435
B   -1.190976
C    1.432707
D   -0.312652
Name: 2013-01-01 00:00:00, dtype: float64

In [30]:
df.loc[dates[0], ['A','B']]

A    0.471435
B   -1.190976
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [31]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.471435 -1.190976
2013-01-02 -0.720589  0.887163
2013-01-03  0.015696 -2.242685
2013-01-04  0.953324 -2.021255
2013-01-05  0.405453  0.289092
2013-01-06 -0.202646 -0.655969

In [32]:
df.loc[1:2, ['A','B']]

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [1] of type int

#### Selection by position

For getting a value explicitly:

In [33]:
df.iloc[1,1]

0.8871629403077386

By integer slices, acting similar to NumPy/Python:

In [34]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.720589  0.887163  0.859588 -0.636524
2013-01-03  0.015696 -2.242685  1.150036  0.991946

For slicing columns explicitly:

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.190976  1.432707
2013-01-02  0.887163  0.859588
2013-01-03 -2.242685  1.150036
2013-01-04 -2.021255 -0.334077
2013-01-05  0.289092  1.321158
2013-01-06 -0.655969  0.193421

By lists of integer position locations, similar to the NumPy/Python style:

In [36]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.720589  0.859588
2013-01-03  0.015696  1.150036
2013-01-05  0.405453  1.321158

#### Boolean indexing

Using a single columns values to select data:

In [37]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.471435 -1.190976  1.432707 -0.312652
2013-01-03  0.015696 -2.242685  1.150036  0.991946
2013-01-04  0.953324 -2.021255 -0.334077  0.002118
2013-01-05  0.405453  0.289092  1.321158 -1.546906

Selecting values from a DataFrame where a boolean condition is met:

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01  0.471435       NaN  1.432707       NaN
2013-01-02       NaN  0.887163  0.859588       NaN
2013-01-03  0.015696       NaN  1.150036  0.991946
2013-01-04  0.953324       NaN       NaN  0.002118
2013-01-05  0.405453  0.289092  1.321158       NaN
2013-01-06       NaN       NaN  0.193421  0.553439

Using the `isin()` method for filtering:

In [39]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.471435 -1.190976  1.432707 -0.312652    one
2013-01-02 -0.720589  0.887163  0.859588 -0.636524    one
2013-01-03  0.015696 -2.242685  1.150036  0.991946    two
2013-01-04  0.953324 -2.021255 -0.334077  0.002118  three
2013-01-05  0.405453  0.289092  1.321158 -1.546906   four
2013-01-06 -0.202646 -0.655969  0.193421  0.553439  three

In [40]:
df2[df2['E'].isin((['two', 'four']))]

                   A         B         C         D     E
2013-01-03  0.015696 -2.242685  1.150036  0.991946   two
2013-01-05  0.405453  0.289092  1.321158 -1.546906  four

#### Setting

Setting a new column automatically aligns the data by the indexes:

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.471435 -1.190976  1.432707 -0.312652  NaN
2013-01-02 -0.720589  0.887163  0.859588 -0.636524  1.0
2013-01-03  0.015696 -2.242685  1.150036  0.991946  2.0
2013-01-04  0.953324 -2.021255 -0.334077  0.002118  3.0
2013-01-05  0.405453  0.289092  1.321158 -1.546906  4.0
2013-01-06 -0.202646 -0.655969  0.193421  0.553439  5.0

In [43]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Setting values by label:

In [44]:
df.loc[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.190976  1.432707 -0.312652  NaN
2013-01-02 -0.720589  0.887163  0.859588 -0.636524  1.0
2013-01-03  0.015696 -2.242685  1.150036  0.991946  2.0
2013-01-04  0.953324 -2.021255 -0.334077  0.002118  3.0
2013-01-05  0.405453  0.289092  1.321158 -1.546906  4.0
2013-01-06 -0.202646 -0.655969  0.193421  0.553439  5.0

Setting values by position:

In [45]:
df.iloc[0,1] = 1
df

                   A         B         C         D    F
2013-01-01  0.000000  1.000000  1.432707 -0.312652  NaN
2013-01-02 -0.720589  0.887163  0.859588 -0.636524  1.0
2013-01-03  0.015696 -2.242685  1.150036  0.991946  2.0
2013-01-04  0.953324 -2.021255 -0.334077  0.002118  3.0
2013-01-05  0.405453  0.289092  1.321158 -1.546906  4.0
2013-01-06 -0.202646 -0.655969  0.193421  0.553439  5.0

Setting by assigning with a NumPy array:

In [46]:
df.loc[:, 'D'] = 5
df

                   A         B         C    D    F
2013-01-01  0.000000  1.000000  1.432707  5.0  NaN
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0
2013-01-03  0.015696 -2.242685  1.150036  5.0  2.0
2013-01-04  0.953324 -2.021255 -0.334077  5.0  3.0
2013-01-05  0.405453  0.289092  1.321158  5.0  4.0
2013-01-06 -0.202646 -0.655969  0.193421  5.0  5.0

A `where` operation with setting:

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000 -1.000000 -1.432707 -5.0  NaN
2013-01-02 -0.720589 -0.887163 -0.859588 -5.0 -1.0
2013-01-03 -0.015696 -2.242685 -1.150036 -5.0 -2.0
2013-01-04 -0.953324 -2.021255 -0.334077 -5.0 -3.0
2013-01-05 -0.405453 -0.289092 -1.321158 -5.0 -4.0
2013-01-06 -0.202646 -0.655969 -0.193421 -5.0 -5.0

### Missing data

In [48]:
df.columns

Index(['A', 'B', 'C', 'D', 'F'], dtype='object')

In [49]:
df.columns + ['E']

Index(['AE', 'BE', 'CE', 'DE', 'FE'], dtype='object')

In [50]:
list(df.columns) + ['E']

['A', 'B', 'C', 'D', 'F', 'E']

In [51]:
df

                   A         B         C    D    F
2013-01-01  0.000000  1.000000  1.432707  5.0  NaN
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0
2013-01-03  0.015696 -2.242685  1.150036  5.0  2.0
2013-01-04  0.953324 -2.021255 -0.334077  5.0  3.0
2013-01-05  0.405453  0.289092  1.321158  5.0  4.0
2013-01-06 -0.202646 -0.655969  0.193421  5.0  5.0

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [52]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  1.000000  1.432707  5.0  NaN NaN
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0 NaN
2013-01-03  0.015696 -2.242685  1.150036  5.0  2.0 NaN
2013-01-04  0.953324 -2.021255 -0.334077  5.0  3.0 NaN

In [53]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  1.000000  1.432707  5.0  NaN  1.0
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0  1.0
2013-01-03  0.015696 -2.242685  1.150036  5.0  2.0  NaN
2013-01-04  0.953324 -2.021255 -0.334077  5.0  3.0  NaN

Drop any rows that have missing data:

In [54]:
df1.dropna()

                   A         B         C    D    F    E
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0  1.0

Fill the missing data:

In [55]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  1.000000  1.432707  5.0  5.0  1.0
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0  1.0
2013-01-03  0.015696 -2.242685  1.150036  5.0  2.0  5.0
2013-01-04  0.953324 -2.021255 -0.334077  5.0  3.0  5.0

In [56]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  1.000000  1.432707  5.0  NaN  1.0
2013-01-02 -0.720589  0.887163  0.859588  5.0  1.0  1.0
2013-01-03  0.015696 -2.242685  1.150036  5.0  2.0  NaN
2013-01-04  0.953324 -2.021255 -0.334077  5.0  3.0  NaN

Gets the boolean mask where values are `nan`:

In [57]:
df1.isna()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### Operations

Performing a descriptive statistic:

In [58]:
df.mean()

A    0.075206
B   -0.457276
C    0.770472
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis:

In [59]:
df.mean(axis=1)

2013-01-01    1.858177
2013-01-02    1.405233
2013-01-03    1.184609
2013-01-04    1.319598
2013-01-05    2.203141
2013-01-06    1.866961
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension:

In [60]:
s = pd.Series([1,3,5, np.nan, 6,8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [61]:
s = s.shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

### Apply

Apply a user defined function to the data:

In [62]:
df.apply(np.cumsum)

                   A         B         C     D     F
2013-01-01  0.000000  1.000000  1.432707   5.0   NaN
2013-01-02 -0.720589  1.887163  2.292295  10.0   1.0
2013-01-03 -0.704892 -0.355522  3.442331  15.0   3.0
2013-01-04  0.248432 -2.376777  3.108254  20.0   6.0
2013-01-05  0.653885 -2.087685  4.429412  25.0  10.0
2013-01-06  0.451239 -2.743654  4.622833  30.0  15.0

### Histogramming

In [63]:
s = pd.Series(np.random.randint(0,7, size=10))
s

0    3
1    3
2    2
3    1
4    6
5    3
6    4
7    2
8    3
9    6
dtype: int32

In [64]:
s.value_counts()

3    4
2    2
6    2
1    1
4    1
Name: count, dtype: int64

### Merge

In [65]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -1.781148  2.290227 -1.505685 -1.080808
1  0.513695  1.098981  0.460085  0.202690
2 -1.489094 -0.646127  1.501537 -0.396477
3 -0.751195  0.178778 -0.836739  0.509396
4 -0.041124 -0.111910 -0.759007 -0.045936
5 -0.907728 -0.279114  0.244120  0.366056
6 -0.271001 -0.071207  0.084837  0.120414
7 -1.268647  0.524837  0.983838 -1.264908
8  0.332566  0.750438 -1.079212 -0.628115
9  0.299347  0.127277  0.926190  2.455240

In [66]:
df[:3]

          0         1         2         3
0 -1.781148  2.290227 -1.505685 -1.080808
1  0.513695  1.098981  0.460085  0.202690
2 -1.489094 -0.646127  1.501537 -0.396477

In [67]:
df[3:7]

          0         1         2         3
3 -0.751195  0.178778 -0.836739  0.509396
4 -0.041124 -0.111910 -0.759007 -0.045936
5 -0.907728 -0.279114  0.244120  0.366056
6 -0.271001 -0.071207  0.084837  0.120414

In [68]:
df[7:]

          0         1         2         3
7 -1.268647  0.524837  0.983838 -1.264908
8  0.332566  0.750438 -1.079212 -0.628115
9  0.299347  0.127277  0.926190  2.455240

In [69]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.781148  2.290227 -1.505685 -1.080808
 1  0.513695  1.098981  0.460085  0.202690
 2 -1.489094 -0.646127  1.501537 -0.396477,
           0         1         2         3
 3 -0.751195  0.178778 -0.836739  0.509396
 4 -0.041124 -0.111910 -0.759007 -0.045936
 5 -0.907728 -0.279114  0.244120  0.366056
 6 -0.271001 -0.071207  0.084837  0.120414,
           0         1         2         3
 7 -1.268647  0.524837  0.983838 -1.264908
 8  0.332566  0.750438 -1.079212 -0.628115
 9  0.299347  0.127277  0.926190  2.455240]

In [70]:
pd.concat(pieces)

          0         1         2         3
0 -1.781148  2.290227 -1.505685 -1.080808
1  0.513695  1.098981  0.460085  0.202690
2 -1.489094 -0.646127  1.501537 -0.396477
3 -0.751195  0.178778 -0.836739  0.509396
4 -0.041124 -0.111910 -0.759007 -0.045936
5 -0.907728 -0.279114  0.244120  0.366056
6 -0.271001 -0.071207  0.084837  0.120414
7 -1.268647  0.524837  0.983838 -1.264908
8  0.332566  0.750438 -1.079212 -0.628115
9  0.299347  0.127277  0.926190  2.455240

### Time Series

Pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). 

Converting secondly data into 5-minutely data by summation:

In [71]:
rng = pd.date_range('1/1/2012', periods=5000, freq='S')
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               ...
               '2012-01-01 01:23:10', '2012-01-01 01:23:11',
               '2012-01-01 01:23:12', '2012-01-01 01:23:13',
               '2012-01-01 01:23:14', '2012-01-01 01:23:15',
               '2012-01-01 01:23:16', '2012-01-01 01:23:17',
               '2012-01-01 01:23:18', '2012-01-01 01:23:19'],
              dtype='datetime64[ns]', length=5000, freq='S')

In [72]:
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    150
2012-01-01 00:00:01    440
2012-01-01 00:00:02    468
2012-01-01 00:00:03    136
2012-01-01 00:00:04    172
                      ...
2012-01-01 01:23:15    262
2012-01-01 01:23:16    303
2012-01-01 01:23:17    340
2012-01-01 01:23:18    256
2012-01-01 01:23:19    303
Freq: S, Length: 5000, dtype: int32

In [73]:
ts.resample('5Min').sum()

2012-01-01 00:00:00    76653
2012-01-01 00:05:00    70161
2012-01-01 00:10:00    71892
2012-01-01 00:15:00    74456
2012-01-01 00:20:00    75833
2012-01-01 00:25:00    72763
2012-01-01 00:30:00    71585
2012-01-01 00:35:00    76566
2012-01-01 00:40:00    75023
2012-01-01 00:45:00    77600
2012-01-01 00:50:00    72258
2012-01-01 00:55:00    76969
2012-01-01 01:00:00    73327
2012-01-01 01:05:00    70668
2012-01-01 01:10:00    75329
2012-01-01 01:15:00    73364
2012-01-01 01:20:00    50519
Freq: 5T, dtype: int32

Converting monthly data into annual data by averaging:

In [74]:
rng = pd.date_range('20000101', periods=100, freq='MS')
rng

DatetimeIndex(['2000-01-01', '2000-02-01', '2000-03-01', '2000-04-01',
               '2000-05-01', '2000-06-01', '2000-07-01', '2000-08-01',
               '2000-09-01', '2000-10-01', '2000-11-01', '2000-12-01',
               '2001-01-01', '2001-02-01', '2001-03-01', '2001-04-01',
               '2001-05-01', '2001-06-01', '2001-07-01', '2001-08-01',
               '2001-09-01', '2001-10-01', '2001-11-01', '2001-12-01',
               '2002-01-01', '2002-02-01', '2002-03-01', '2002-04-01',
               '2002-05-01', '2002-06-01', '2002-07-01', '2002-08-01',
               '2002-09-01', '2002-10-01', '2002-11-01', '2002-12-01',
               '2003-01-01', '2003-02-01', '2003-03-01', '2003-04-01',
               '2003-05-01', '2003-06-01', '2003-07-01', '2003-08-01',
               '2003-09-01', '2003-10-01', '2003-11-01', '2003-12-01',
               '2004-01-01', '2004-02-01', '2004-03-01', '2004-04-01',
               '2004-05-01', '2004-06-01', '2004-07-01', '2004-08-01',
               '2004-09-01', '2004-10-01', '2004-11-01', '2004-12-01',
               '2005-01-01', '2005-02-01', '2005-03-01', '2005-04-01',
               '2005-05-01', '2005-06-01', '2005-07-01', '2005-08-01',
               '2005-09-01', '2005-10-01', '2005-11-01', '2005-12-01',
               '2006-01-01', '2006-02-01', '2006-03-01', '2006-04-01',
               '2006-05-01', '2006-06-01', '2006-07-01', '2006-08-01',
               '2006-09-01', '2006-10-01', '2006-11-01', '2006-12-01',
               '2007-01-01', '2007-02-01', '2007-03-01', '2007-04-01',
               '2007-05-01', '2007-06-01', '2007-07-01', '2007-08-01',
               '2007-09-01', '2007-10-01', '2007-11-01', '2007-12-01',
               '2008-01-01', '2008-02-01', '2008-03-01', '2008-04-01'],
              dtype='datetime64[ns]', freq='MS')

In [75]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2000-01-01    1.031141
2000-02-01    0.529412
2000-03-01   -0.933707
2000-04-01   -1.025651
2000-05-01    1.581512
                ...
2007-12-01    2.990877
2008-01-01   -1.734529
2008-02-01    1.518227
2008-03-01   -0.706861
2008-04-01    0.174108
Freq: MS, Length: 100, dtype: float64

In [76]:
ts2 = ts.resample('Y').mean()
ts2

2000-12-31   -0.206850
2001-12-31    0.306418
2002-12-31    0.288540
2003-12-31    0.237596
2004-12-31   -0.173003
2005-12-31   -0.341516
2006-12-31    0.301834
2007-12-31    0.380726
2008-12-31   -0.187264
Freq: A-DEC, dtype: float64

In [77]:
ts2 = ts2.to_period('M')
ts2

2000-12   -0.206850
2001-12    0.306418
2002-12    0.288540
2003-12    0.237596
2004-12   -0.173003
2005-12   -0.341516
2006-12    0.301834
2007-12    0.380726
2008-12   -0.187264
Freq: M, dtype: float64